---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyMonitorFailures.GridDeletedSameName
source: html/e6153c00-cf20-1d4f-3ade-b73a0cfb16b7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyMonitorFailures.GridDeletedSameName Property

Grid cannot be copied because grid with desired name '[Name]' already exist in a target document.

## Syntax (C#)
```csharp
public static FailureDefinitionId GridDeletedSameName { get; }
```